In [1]:
d = {
    "name" : "Niraj",
    "age" : 24,
    "gender" : "Male",
    "college" : "Sinhgad",
    "branch" : "Mechanical"
}

In [2]:
import pandas as pd

In [3]:
d

{'name': 'Niraj',
 'age': 24,
 'gender': 'Male',
 'college': 'Sinhgad',
 'branch': 'Mechanical'}

In [8]:
df = pd.Series(d).to_frame()

In [9]:
df

                  0
name          Niraj
age              24
gender         Male
college     Sinhgad
branch   Mechanical